{
  "recetas": [
    {
      "id": "1",
      "name": "Torta de Chocolate",
      "description": "Un delicioso pastel de chocolate esponjoso con cobertura de crema de cacao.",
      "image": "/images/torta_de_chocolate.png",
      "fav": true
    },
    {
      "id": "2",
      "name": "Ensalada César",
      "description": "Una ensalada fresca con lechuga, pollo, crutones y aderezo César.",
      "image": "/images/cesar.png",
      "fav": false
    },
    {
      "id": "3",
      "name": "Sopa de Tomate",
      "description": "Una sopa cremosa de tomate con un toque de albahaca.",
      "ingredients": [
        "tomate",
        "cebolla",
        "ajo",
        "albahaca",
        "crema"
      ],
      "instructions": "1. Picar la cebolla y el ajo y sofreír en una sartén con aceite hasta que estén dorados. 2. Añadir los tomates picados y cocinar por 10 minutos. 3. Agregar caldo de verduras y dejar hervir. 4. Triturar la mezcla con una licuadora hasta que quede suave. 5. Añadir la crema y albahaca picada antes de servir.",
      "image": "/images/gazpacho.png",
      "favorite": false
    },
    {
      "id": "4",
      "name": "Pizza Margarita",
      "description": "Pizza clásica con salsa de tomate, queso mozzarella y albahaca fresca.",
      "ingredients": [
        "masa de pizza",
        "salsa de tomate",
        "queso mozzarella",
        "albahaca"
      ],
      "instructions": "1. Precalentar el horno a 220°C. 2. Estirar la masa de pizza sobre una bandeja para hornear. 3. Extender una capa de salsa de tomate sobre la masa. 4. Colocar el queso mozzarella en trozos sobre la salsa. 5. Hornear durante 10-15 minutos hasta que la masa esté dorada y el queso derretido. 6. Agregar hojas de albahaca fresca antes de servir.",
      "image": "/images/pizza.png",
      "favorite": false
    },
    {
      "id": "5",
      "name": "Tacos de Carnitas",
      "description": "Tacos tradicionales de cerdo desmenuzado con cebolla y cilantro.",
      "ingredients": [
        "carne de cerdo",
        "tortillas",
        "cebolla",
        "cilantro",
        "limón"
      ],
      "instructions": "1. Cocinar la carne de cerdo en una olla con agua, cebolla y especias hasta que esté tierna. 2. Desmenuzar la carne de cerdo. 3. Calentar las tortillas en un sartén. 4. Colocar la carne desmenuzada en las tortillas. 5. Agregar cebolla picada, cilantro y unas gotas de limón al gusto.",
      "image": "/images/taquitos.png",
      "favorite": false
    },
    {
      "id": "6",
      "name": "Guacamole",
      "description": "Una mezcla cremosa de aguacate, tomate, cebolla y limón.",
      "ingredients": [
        "aguacate",
        "tomate",
        "cebolla",
        "limón",
        "cilantro"
      ],
      "instructions": "1. Pelar y triturar los aguacates en un bol. 2. Picar finamente el tomate, la cebolla y el cilantro. 3. Añadir los ingredientes picados al aguacate. 4. Exprimir el jugo de limón y mezclar bien. 5. Servir inmediatamente con tortillas o como acompañamiento.",
      "image": "/images/nachos.png",
      "favorite": false
    },
    {
      "id": "7",
      "name": "Paella Valenciana",
      "description": "Un plato tradicional español con arroz, mariscos, pollo y verduras.",
      "ingredients": [
        "arroz",
        "mariscos",
        "pollo",
        "pimiento",
        "guisantes",
        "azafrán"
      ],
      "instructions": "1. Sofreír el pollo en una paellera con aceite hasta que esté dorado. 2. Añadir los pimientos cortados y los guisantes. 3. Incorporar el arroz y mezclar bien. 4. Verter caldo caliente y añadir el azafrán. 5. Cocinar durante 20 minutos, luego agregar los mariscos y continuar cocinando hasta que el arroz esté listo.",
      "image": "/images/paella.png",
      "favorite": false
    },
    {
      "id": "8",
      "name": "Sushi de Atún",
      "description": "Sushi con arroz, alga nori y frescas láminas de atún.",
      "ingredients": [
        "arroz de sushi",
        "alga nori",
        "atún",
        "vinagre de arroz"
      ],
      "instructions": "1. Cocinar el arroz de sushi según las instrucciones del paquete. 2. Enfriar el arroz y aliñarlo con vinagre de arroz. 3. Cortar el atún en láminas finas. 4. Colocar una hoja de alga nori sobre una esterilla para sushi y cubrir con una capa de arroz. 5. Colocar el atún en el centro y enrollar con la esterilla. 6. Cortar en trozos y servir.",
      "image": "/images/sushi.png",
      "favorite": false
    },
    {
      "id": "9",
      "name": "Croquetas de Jamón",
      "description": "Croquetas rellenas de jamón serrano y bechamel cremosa.",
      "ingredients": [
        "jamón serrano",
        "harina",
        "leche",
        "mantequilla",
        "pan rallado"
      ],
      "instructions": "1. Derretir la mantequilla y añadir la harina para hacer una roux. 2. Agregar la leche poco a poco y cocinar hasta obtener una salsa espesa. 3. Incorporar el jamón serrano picado y mezclar bien. 4. Dejar enfriar la mezcla y formar pequeñas bolas. 5. Pasar las croquetas por pan rallado y freír en aceite caliente hasta que estén doradas.",
      "image": "/images/croquetas.png",
      "favorite": false
    },
    {
      "id": "10",
      "name": "Smoothie de Fresa y Plátano",
      "description": "Un batido refrescante y saludable con fresa y plátano.",
      "ingredients": [
        "fresas",
        "plátano",
        "yogur",
        "miel",
        "hielo"
      ],
      "instructions": "1. Colocar las fresas, el plátano y el yogur en una licuadora. 2. Añadir miel al gusto y un poco de hielo. 3. Licuar hasta obtener una mezcla suave. 4. Servir en un vaso y disfrutar.",
      "image": "/images/smoothie.png",
      "favorite": false
    }
  ]
}